---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthOutOption
source: html/18fc3998-08c9-c407-cd52-4ad1e79c11e1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthOutOption Property

"Main Secondary Width Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartWidthOutOption { get; }
```